; domain
(define (domain minerob)
  (:requirements :strips :typing :negative-preconditions :equality :adl)

  (:types area minecar)

  (:predicates
    (robot-at ?a - area)                    ;; robot is located at area ?a
    (minecar-at ?m - minecar ?a - area)     ;; minecar ?m is at area ?a
    (minerals ?a - area)                    ;; area ?a contains minerals
    (depleted ?a - area)                    ;; area ?a has been depleted (no minerals)
    (empty ?a - area)                       ;; there is no minecar in area ?a
    (adjacent ?a1 - area ?a2 - area)        ;; adjacency (horizontal/vertical)
  )

  ;; MOVE: robot walks from one area to an adjacent area.
  ;; Precondition: destination must be empty of minecars.
  (:action move
    :parameters (?from - area ?to - area)
    :precondition (and
      (robot-at ?from)
      (adjacent ?from ?to)
      ;(empty ?to)                            ;; cannot step into a minecar
    )
    :effect (and
      (not (robot-at ?from))
      (robot-at ?to)
    )
  )

  ;; COLLECT: robot drills and collects minerals in current area.
  (:action collect
    :parameters (?a - area)
    :precondition (and
      (robot-at ?a)
      (minerals ?a)
      (empty ?a)                               ;; not minecart into to collect
    )
    :effect (and
      (not (minerals ?a))
      (depleted ?a)
    )
  )

  ;; PUSH: robot pushes a minecar forward.
  ;; Semantics chosen: robot stands *behind* the minecar, pushes the minecar from its current cell into the next cell.
  ;; Precond: robot adjacent to minecar source cell, the target cell (where the minecar will go) is adjacent to the minecar cell and is empty.
  ;; Effects: robot moves into the minecar's old cell, minecar moves into the target cell;
  ;;          minecar's old cell becomes empty, the target cell becomes non-empty.
  (:action push
    :parameters (?m - minecar ?mcpos - area ?target - area)
    :precondition (and
      (robot-at ?mcpos)
      (minecar-at ?m ?mcpos)
      (adjacent ?mcpos ?target)              ;; target is adjacent to minecar cell
      (empty ?target)                         ;; target must be free of minecars
    )
    :effect (and
      ;; robot moves into minecar's old position
      ;(not (robot-at ?rpos))
      ;(robot-at ?mcpos)

      ;; minecar moves from mcpos to target
      (not (minecar-at ?m ?mcpos))
      (minecar-at ?m ?target)

      ;; empty predicate bookkeeping
      (empty ?mcpos)                          ;; old minecar cell becomes empty
      (not (empty ?target))                   ;; new minecar cell becomes non-empty
    )
  )
)

; problem
(define (problem minerob-4x4-puzzle)
  (:domain minerob)

  (:objects
    a1 a2 a3 a4 a5 a6 a7 a8 a9 a10 a11 a12 a13 a14 a15 a16 - area
    carA carB carC - minecar
  )

  (:init
    ;; --- Adjacency (Horizontal) ---
    (adjacent a1 a2) (adjacent a2 a1) (adjacent a2 a3) (adjacent a3 a2) (adjacent a3 a4) (adjacent a4 a3)
    (adjacent a5 a6) (adjacent a6 a5) (adjacent a6 a7) (adjacent a7 a6) (adjacent a7 a8) (adjacent a8 a7)
    (adjacent a9 a10) (adjacent a10 a9) (adjacent a10 a11) (adjacent a11 a10) (adjacent a11 a12) (adjacent a12 a11)
    (adjacent a13 a14) (adjacent a14 a13) (adjacent a14 a15) (adjacent a15 a14) (adjacent a15 a16) (adjacent a16 a15)

    ;; --- Adjacency (Vertical) ---
    (adjacent a1 a5) (adjacent a5 a1) (adjacent a5 a9) (adjacent a9 a5) (adjacent a9 a13) (adjacent a13 a9)
    (adjacent a2 a6) (adjacent a6 a2) (adjacent a6 a10) (adjacent a10 a6) (adjacent a10 a14) (adjacent a14 a10)
    (adjacent a3 a7) (adjacent a7 a3) (adjacent a7 a11) (adjacent a11 a7) (adjacent a11 a15) (adjacent a15 a11)
    (adjacent a4 a8) (adjacent a8 a4) (adjacent a8 a12) (adjacent a12 a8) (adjacent a12 a16) (adjacent a16 a12)

    ;; Robot start
    (robot-at a10)

    ;; Minecars initial positions
    (minecar-at carA a1)
    (minecar-at carB a7)
    (minecar-at carC a14)

    ;; Empty bookkeeping:
    ;; All cells without a minecar must be declared empty.
    ;; Initially: a10 (robot), a2, a3, a4, a5, a6, a8, a9, a11, a12, a13, a15, a16
    (empty a2) (empty a3) (empty a4) (empty a5) (empty a6) (empty a8)
    (empty a9) (empty a10) (empty a11) (empty a12) (empty a13) (empty a15) (empty a16)

    ;; Minerals initial positions
    (minerals a1)  ; Con carA
    (minerals a7)  ; Con carB
    (minerals a14) ; Con carC

    ;; Depleted (all other cells start as depleted or without minerals)
    (depleted a2) (depleted a3) (depleted a4) (depleted a5) (depleted a6) (depleted a8)
    (depleted a9) (depleted a10) (depleted a11) (depleted a12) (depleted a13) (depleted a15) (depleted a16)
  )

  ;; Goal: all minerals collected (depleted) and specific final minecar positions
  (:goal (and
    (depleted a1)  ; Mineral en a1 recogido
    (depleted a7)  ; Mineral en a7 recogido
    (depleted a14) ; Mineral en a14 recogido
    
    ;; Final positions for minecars
    (minecar-at carA a2)
    (minecar-at carB a8)
    (minecar-at carC a15)

    ;; Final position for robot
    (robot-at a10)
  ))
)

; plan
1. (move a10 a6)
   deleted: (robot-at a10)
   added: (robot-at a6)
   goals met: 0 of 7
2. (move a6 a2)
   deleted: (robot-at a6)
   added: (robot-at a2)
   goals met: 0 of 7
3. (move a2 a1)
   deleted: (robot-at a2)
   added: (robot-at a1)
   goals met: 0 of 7
4. (push cara a1 a2)
   deleted: (minecar-at cara a1) (empty a2)
   added: (minecar-at cara a2) (empty a1)
   goals met: 1 of 7
5. (collect a1)
   deleted: (minerals a1)
   added: (depleted a1)
   goals met: 2 of 7
6. (move a1 a2)
   deleted: (robot-at a1)
   added: (robot-at a2)
   goals met: 2 of 7
7. (move a2 a3)
   deleted: (robot-at a2)
   added: (robot-at a3)
   goals met: 2 of 7
8. (move a3 a7)
   deleted: (robot-at a3)
   added: (robot-at a7)
   goals met: 2 of 7
9. (push carb a7 a8)
   deleted: (minecar-at carb a7) (empty a8)
   added: (minecar-at carb a8) (empty a7)
   goals met: 3 of 7
10. (collect a7)
   deleted: (minerals a7)
   added: (depleted a7)
   goals met: 4 of 7
11. (move a7 a11)
   deleted: (robot-at a7)
   added: (robot-at a11)
   goals met: 4 of 7
12. (move a11 a10)
   deleted: (robot-at a11)
   added: (robot-at a10)
   goals met: 5 of 7
13. (move a10 a14)
   deleted: (robot-at a10)
   added: (robot-at a14)
   goals met: 4 of 7
14. (push carc a14 a15)
   deleted: (minecar-at carc a14) (empty a15)
   added: (minecar-at carc a15) (empty a14)
   goals met: 5 of 7
15. (collect a14)
   deleted: (minerals a14)
   added: (depleted a14)
   goals met: 6 of 7
16. (move a14 a10)
   deleted: (robot-at a14)
   added: (robot-at a10)
   goals met: 7 of 7
